Австралия/src/Catalogs/POSTerminals/POSTerminals.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>POSTerminals</name>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>PettyCash</name>
    <type>
      <types>CatalogRef.CashRegisters</types>
    </type>
  </attributes>
  <attributes>
    <name>Peripherals</name>
    <type>
      <types>CatalogRef.Peripherals</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>UseWithoutEquipmentConnection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfPOS</name>
    <type>
      <types>EnumRef.TypesOfPOS</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentProcessor</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentProcessorContract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>WithholdFeeOnPayout</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentCardKinds</name>
    <attributes>
      <name>ChargeCardKind</name>
      <type>
        <types>CatalogRef.PaymentCardTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>FeePercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FeeFixedPart</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/DefaultGLAccounts/DefaultGLAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DefaultGLAccounts</name>
  <predefined>
    <items>
      <name>AccountsPayable</name>
      <description>Accounts payable</description>
    </items>
    <items>
      <name>AccountsReceivable</name>
      <description>Accounts receivable</description>
    </items>
    <items>
      <name>AdvanceHolders</name>
      <description>Advance holders</description>
    </items>
    <items>
      <name>AdvanceHoldersPayable</name>
      <description>Advance holders payable</description>
    </items>
    <items>
      <name>AdvancesToSuppliers</name>
      <description>Advances to suppliers</description>
    </items>
    <items>
      <name>BankAccount</name>
      <description>Bank account</description>
    </items>
    <items>
      <name>BankFeesCreditAccount</name>
      <description>Bank fees credit account</description>
    </items>
    <items>
      <name>BankFeesExpenseAccount</name>
      <description>Bank fees expense account</description>
    </items>
    <items>
      <name>CapitalIntroduction</name>
      <description>Capital introduction</description>
    </items>
    <items>
      <name>CashAccount</name>
      <description>Cash account</description>
    </items>
    <items>
      <name>CommissionExpensesOnLoansBorrowed</name>
      <description>Commission expenses on loans borrowed</description>
    </items>
    <items>
      <name>CommissionIncomeOnLoansLent</name>
      <description>Commission income on loans lent</description>
    </items>
    <items>
      <name>CostOfSales</name>
      <description>Cost of sales</description>
    </items>
    <items>
      <name>CreditCardSalesReceivedAtALaterDate</name>
      <description>Credit card sales received at a later date</description>
    </items>
    <items>
      <name>CustomerAdvances</name>
      <description>Customer advances</description>
    </items>
    <items>
      <name>DiscountAllowed</name>
      <description>Discount allowed</description>
    </items>
    <items>
      <name>DiscountReceived</name>
      <description>Discount received</description>
    </items>
    <items>
      <name>Expenses</name>
      <description>Expenses</description>
    </items>
    <items>
      <name>FixedAssets</name>
      <description>Fixed assets</description>
    </items>
    <items>
      <name>FixedAssetsDepreciation</name>
      <description>Fixed assets depreciation</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeGain</name>
      <description>Foreign currency exchange gain</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeLoss</name>
      <description>Foreign currency exchange loss</description>
    </items>
    <items>
      <name>FundsTransfersBeingProcessed</name>
      <description>Funds transfers being processed</description>
    </items>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>IncomeSummary</name>
      <description>Income summary</description>
    </items>
    <items>
      <name>InterestExpensesOnLoansBorrowed</name>
      <description>Interest expenses on loans borrowed</description>
    </items>
    <items>
      <name>InterestIncome</name>
      <description>Interest income</description>
    </items>
    <items>
      <name>InterestPayable</name>
      <description>Interest payable</description>
    </items>
    <items>
      <name>InterestReceivable</name>
      <description>Interest receivable</description>
    </items>
    <items>
      <name>Inventory</name>
      <description>Inventory</description>
    </items>
    <items>
      <name>LoansBorrowed</name>
      <description>Loans borrowed</description>
    </items>
    <items>
      <name>LoansLentToCounerparty</name>
      <description>Loans lent to counterparty</description>
    </items>
    <items>
      <name>LoansLentToEmployee</name>
      <description>Loans lent to employee</description>
    </items>
    <items>
      <name>OpeningBalanceEquity</name>
      <description>Opening balance equity account (to balance opening entries)</description>
    </items>
    <items>
      <name>OtherIncome</name>
      <description>Other income</description>
    </items>
    <items>
      <name>PayrollExpenses</name>
      <description>Payroll expenses</description>
    </items>
    <items>
      <name>PayrollPayable</name>
      <description>Payroll payable</description>
    </items>
    <items>
      <name>PettyCashAccount</name>
      <description>Petty cash account</description>
    </items>
    <items>
      <name>PurchaseCostDiscrepancies</name>
      <description>Purchase cost discrepancies</description>
    </items>
    <items>
      <name>RetailMarkup</name>
      <description>Retail markup for retail inventory method</description>
    </items>
    <items>
      <name>TaxPayable</name>
      <description>Tax payable</description>
    </items>
    <items>
      <name>TaxRefund</name>
      <description>Tax refund</description>
    </items>
    <items>
      <name>VATInput</name>
      <description>VAT input</description>
    </items>
    <items>
      <name>VATAdvancesToSuppliers</name>
      <description>VAT on advance payments paid to suppliers</description>
    </items>
    <items>
      <name>VATAdvancesFromCustomers</name>
      <description>VAT on advance payments received from customers</description>
    </items>
    <items>
      <name>VATOutput</name>
      <description>VAT output</description>
    </items>
    <items>
      <name>VATReverseCharge</name>
      <description>VAT reverse charge</description>
    </items>
    <items>
      <name>WorkInProgress</name>
      <description>Work-in-progress</description>
    </items>
    <items>
      <name>WriteOffOverUnderMOHToCOGS</name>
      <description>Write-off over/underallocated manufacturing overheads to COGS</description>
    </items>
  </predefined>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/POSTerminals/Forms/GLAccountsEditForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	GLAccount = Parameters.GLAccount;
	
	If CancelGLAccountChange(Parameters.Ref) Then
		Items.GLAccountsGroup.ToolTip = NStr("en = 'Records are registered for this POS terminal in the infobase. Cannot change the GL account.'; ru = 'В базе есть движения по этому эквайринговому терминалу. Изменение счета учета запрещено.';pl = 'W bazie informacyjnej są rejestrowane wpisy dla tego terminala POS. Nie można zmienić konta ewidencji.';es_ES = 'Grabaciones se han registrado para este terminal TPV en la infobase. No se puede cambiar la cuenta del libro mayor.';es_CO = 'Grabaciones se han registrado para este terminal TPV en la infobase. No se puede cambiar la cuenta del libro mayor.';tr = 'Bu POS terminali için Infobase''de kayıtlar mevcut. Muhasebe hesabı değiştirilemez.';it = 'Nel database ci sono movimenti per questo terminale POS. Impossibile modificare il conto mastro.';de = 'Für dieses POS-Terminal sind in der Infobase Aufzeichnungen registriert. Das Hauptbuch-Konto kann nicht geändert werden.'");
		Items.GLAccountsGroup.Enabled = False;
	EndIf;
	
EndProcedure

&AtClient
Procedure Default(Command)
	
	GLAccount = GetDefaultGLAccount();
	NotifyAboutSettlementAccountChange();
	
EndProcedure

&AtClient
Procedure GLAccountOnChange(Item)
	
	If NOT ValueIsFilled(GLAccount) Then
		GLAccount = GetDefaultGLAccount();
	EndIf;
	
	NotifyAboutSettlementAccountChange();
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Function CancelGLAccountChange(Ref)
	
	If Not ValueIsFilled(Ref) Then
		Return False;
	EndIf;
	
	Query = New Query(
	"SELECT ALLOWED TOP 1
	|	ShiftClosurePaymentWithPaymentCards.Ref AS Ref
	|FROM
	|	Document.ShiftClosure.PaymentWithPaymentCards AS ShiftClosurePaymentWithPaymentCards
	|WHERE
	|	ShiftClosurePaymentWithPaymentCards.Ref.Posted
	|	AND ShiftClosurePaymentWithPaymentCards.POSTerminal = &POSTerminal");
	
	Query.SetParameter("POSTerminal", Ref);
	
	Result = Query.Execute();
	
	Return Not Result.IsEmpty();
	
EndFunction

&AtServerNoContext
Function GetDefaultGLAccount()
	Return Catalogs.DefaultGLAccounts.GetDefaultGLAccount("CreditCardSalesReceivedAtALaterDate");	
EndFunction

&AtClient
Procedure NotifyAboutSettlementAccountChange()
	
	ParameterStructure = New Structure(
		"GLAccount",
		GLAccount);
	
	Notify("GLAccountChangedPOSTerminals", ParameterStructure);
	
EndProcedure

#EndRegion
